app/views/public_activity/project/_assign.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <% if a.trackable %>
    <% consultant = User.where(id: a.assignment_consultant_id).first %>