app/views/users/show.html.erb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 ORDER BY "tasks"."id" ASC LIMIT $2  [["project_id", 55], ["LIMIT", 1]]
---
        <div class='consultant-tasks-timeline'>
          <%= timeline @user.find_tasks_in_array(project), colors: @user.get_color_tasks(project)%>