app/views/projects/_project.html.erb

  <td class="project-budget"><%= project.man_days ? project.man_days : "-" %></td>
  <td class="project-progress"><%= project.tasks.size == 0 ? "-" : "#{project.completion_percentage.to_i}%" %></td>
---
SELECT "projects".* FROM "projects"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 53]]