app/views/projects/_tab_issues.html.erb

SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = $1  [["project_id", 2]]
---
    <div id='issues'>
      <% @project.issues.each do |issue| %>