app/views/projects/show.html.erb

            Issues:
            <% @project.issues.each do |issue| %>
---
SELECT "issues".* FROM "issues" WHERE "issues"."project_id" = $1  [["project_id", 1]]