app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "phone", "website", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "New Client"], ["phone", ""], ["website", ""], ["email", ""], ["created_at", 2016-08-25 12:54:57 UTC], ["updated_at", 2016-08-25 12:54:57 UTC]]
---
  def create
    @client = Client.create(client_params)

UPDATE "clients" SET "email" = $1, "address" = $2, "phone" = $3, "website" = $4, "updated_at" = $5 WHERE "clients"."id" = $6  [["email", "lukasas@fjff.at"], ["address", ""], ["phone", ""], ["website", ""], ["updated_at", 2016-08-25 15:48:34 UTC], ["id", 1]]
---
  def update
    @client.update(client_params)