app/controllers/issues_controller.rb

  def update
    @issue.update(issue_params)
    @issue.create_activity :update, owner: current_user, project_id: @project.id
---
UPDATE "issues" SET "comment" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["comment", "dakklsadkladskldaslkadslkadsldsaa"], ["updated_at", 2016-08-24 20:41:09 UTC], ["id", 1]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def mark_as_resolved
    @issue = Issue.find(params[:id])
    @issue.mark_as_resolved
    if @issue.save
      respond_to do |format|
        format.html { redirect_to project_path(@project) }
        format.js  # <-- will render `app/views/reviews/create.js.erb`
      end
    end
    if @issue.is_resolved
      @issue.create_activity :marked_as_resolved, owner: current_user, project_id: @project.id
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "issues" SET "is_resolved" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["is_resolved", true], ["updated_at", 2016-08-24 15:35:12 UTC], ["id", 2]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def find_project
    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_issue
    @issue = Issue.find(params[:id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]