app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
SELECT "users".* FROM "users"
---
  def index
    @projects = Project.all
    @project = Project.new
    @users = User.all

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 48]]
---
  def show
    @users = User.all
    @task = Task.new
    @tasks = @project.tasks
    @task_count = @project.tasks.count

INSERT INTO "projects" ("name", "description", "man_days", "project_manager_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sales Strategy for ING "], ["description", ""], ["man_days", 60], ["project_manager_id", 47], ["created_at", 2016-08-25 08:48:59 UTC], ["updated_at", 2016-08-25 08:48:59 UTC]]
INSERT INTO "assignments" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 53], ["user_id", 32], ["created_at", 2016-08-25 08:48:59 UTC], ["updated_at", 2016-08-25 08:48:59 UTC]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trackable_type", "Assignment"], ["trackable_id", 29], ["key", "assignment.create"], ["created_at", 2016-08-25 08:48:59 UTC], ["updated_at", 2016-08-25 08:48:59 UTC]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."project_id" = $1  [["project_id", 53]]
---
  def create
    @project = Project.new(project_params)
    @project.save

    # project_params[:assignments_attributes]['0'][:user_id].each do |user_id|
    #   assign = @project.assignments.build(user_id: user_id)
    #   assign.save!
    # end
    assignments_params[:user_ids].drop(1).each do |user_id|
      @project.assignments.build(user_id: user_id)
    end
    if @project.save
      @project.create_activity :create, owner: current_user, project_id: @project.id
      @project.assignments.each do |consultant|

UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["description", "Awesome test projectdsfsdfjdsfjkdsfjklsfjklsfjklsfjkl"], ["updated_at", 2016-08-25 12:07:09 UTC], ["id", 1]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def update
    if @project.update(project_params)
      @project.create_activity :update, owner: current_user, project_id: @project.id

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_project
    @project = Project.find(params[:id])

SELECT "activities".* FROM "activities" WHERE "activities"."project_id" = $1 ORDER BY created_at DESC  [["project_id", 1]]
---
  def load_activities
    @activities = PublicActivity::Activity.order('created_at DESC').where(project_id: @project.id)