app/controllers/projects_controller.rb

  def show
    @consultants = @project.users
    @task = Task.new
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 48]]