app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.project_id = params[:project_id]
    if @task.save
      respond_to do |format|
        format.html { redirect_to projects_path(project) }
        format.js  # <-- will render `app/views/reviews/create.js.erb`
      end
    end
    @task.create_activity :create, owner: current_user, project_id: @project.id
---
INSERT INTO "tasks" ("name", "project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "jwdallkjsad"], ["project_id", 52], ["user_id", 2], ["created_at", 2016-08-25 08:27:12 UTC], ["updated_at", 2016-08-25 08:27:12 UTC]]
INSERT INTO "activities" ("trackable_type", "trackable_id", "owner_type", "owner_id", "key", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def mark_done
    @task.mark_done
    @project = Project.find(params[:project_id])
    if @task.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "is_done" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["is_done", false], ["updated_at", 2016-08-24 18:45:53 UTC], ["id", 1]]