app/controllers/users_controller.rb

  def show
    @projects = @user.projects.select{|project| project.has_consultant(@user)}
---
SELECT "projects".* FROM "projects" INNER JOIN "assignments" ON "projects"."id" = "assignments"."project_id" WHERE "assignments"."user_id" = $1  [["user_id", 70]]

  def update
    @user.update(user_params)
---
UPDATE "users" SET "last_name" = $1, "job_title" = $2, "mobile_phone" = $3, "phone" = $4, "description" = $5, "is_owner" = $6, "updated_at" = $7 WHERE "users"."id" = $8  [["last_name", "Guttwinskiiiiii#"], ["job_title", ""], ["mobile_phone", ""], ["phone", ""], ["description", ""], ["is_owner", false], ["updated_at", 2016-08-25 15:17:53 UTC], ["id", 15]]