app/controllers/user_management_controller.rb

  def index
    @users = User.where.not(last_sign_in_at: nil)
    @pending_user_invitations = User.where(invitation_accepted_at: nil, last_sign_in_at: nil, is_client: false)
    @is_client_users =User.where(is_client: true)
---
SELECT "users".* FROM "users" WHERE ("users"."last_sign_in_at" IS NOT NULL)
SELECT "users".* FROM "users" WHERE "users"."invitation_accepted_at" IS NULL AND "users"."last_sign_in_at" IS NULL AND "users"."is_client" = $1  [["is_client", false]]
SELECT "users".* FROM "users" WHERE "users"."is_client" = $1  [["is_client", true]]